-- phpMyAdmin SQL Dump
-- version 5.0.2
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1:3306
-- Время создания: Мар 18 2022 г., 14:50
-- Версия сервера: 10.3.22-MariaDB
-- Версия PHP: 7.1.33

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `test2`
--

-- --------------------------------------------------------

--
-- Структура таблицы `gruppa`
--

CREATE TABLE `gruppa` (
  `id` int(11) NOT NULL,
  `Naim` varchar(250) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `gruppa`
--

INSERT INTO `gruppa` (`id`, `Naim`) VALUES
(1, 'Admin'),
(2, 'ТП-2'),
(3, 'КС-4'),
(4, 'ТП3');

-- --------------------------------------------------------

--
-- Структура таблицы `otv`
--

CREATE TABLE `otv` (
  `id` int(11) NOT NULL,
  `kod_v` varchar(50) NOT NULL,
  `otv` varchar(250) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `otv`
--

INSERT INTO `otv` (`id`, `kod_v`, `otv`) VALUES
(90, '30', 'Перемножить длину высоту и высоту'),
(91, '30', 'Вычислить периметр и умножить на 2'),
(92, '30', 'Вычислить площадь и умножить на 2'),
(93, '31', 'Цельсия'),
(94, '31', 'Кельвин'),
(95, '31', 'Паскаль'),
(96, '32', 'Давление'),
(97, '32', 'Объем'),
(98, '32', 'Влажность'),
(99, '33', 'Температура'),
(100, '33', 'Давление'),
(101, '33', 'Объем'),
(102, '34', 'Объем'),
(103, '34', 'Площадь'),
(104, '34', 'Расстояние'),
(153, '48', '2,5'),
(154, '48', '25'),
(155, '48', '0,25'),
(156, '49', 'Венера'),
(157, '49', 'Марс'),
(158, '49', 'Юпитер'),
(159, '50', '385 000 км.'),
(160, '50', '386 000 км.'),
(161, '50', '384 000 км.'),
(162, '51', '8'),
(163, '51', '9'),
(164, '51', '7'),
(165, '52', 'Сириус'),
(166, '52', 'Бетельгейзе'),
(167, '52', 'Проксима Центавра'),
(168, '53', '150 млн. км.'),
(169, '53', '152 млн. км.'),
(170, '53', '148 млн. км.'),
(171, '54', '12'),
(172, '54', '22'),
(173, '54', '3'),
(174, '55', 'Уран'),
(175, '55', 'плутоний'),
(176, '55', 'нептуний'),
(177, '56', 'Простые'),
(178, '56', 'Сложные'),
(179, '56', 'Составные'),
(180, '57', 'Малиновый'),
(181, '57', 'Розовый'),
(182, '57', 'Оранжевый'),
(183, '58', '22,4 л.'),
(184, '58', '22 л.'),
(185, '58', '23, 4 л.'),
(186, '59', '125'),
(187, '59', '126'),
(188, '59', '127'),
(189, '60', 'Перемножить длину высоту и ширину'),
(190, '60', 'Вычислить периметр * 2'),
(191, '60', 'Вычислить площадь * 2'),
(192, '61', '125'),
(193, '61', '128'),
(194, '61', '129'),
(195, '62', '2pir'),
(196, '62', '2r*2r'),
(197, '62', '6*2r'),
(198, '63', '5100'),
(199, '63', '5200'),
(200, '63', '5050'),
(204, '65', '1101'),
(205, '65', '1110'),
(206, '65', '1010'),
(207, '66', '256.51.244.201'),
(208, '66', '234.456.234.156'),
(209, '66', '192.168.0.51'),
(210, '67', 'Программа счета чисел'),
(211, '67', 'Программа перевода чисел'),
(212, '67', ' разновидность управляющей конструкции в высокоуровневых языках программирования, предназначенная для организации многократного исполнения набора инструкций'),
(213, '68', 'Последовательность действий приводящих к определенному результату?'),
(214, '68', 'Программа счета чисел'),
(215, '68', 'Порядок чисел в программе'),
(216, '69', 'Атом'),
(217, '69', 'Молекула'),
(218, '69', 'Вещество'),
(219, '70', 'Ответ 1'),
(220, '70', 'Ответ 2'),
(221, '70', 'Ответ 3'),
(230, '72', '1'),
(231, '72', '2'),
(232, '72', '3'),
(233, '72', '4'),
(234, '72', '5'),
(249, '77', '1'),
(250, '77', '2'),
(251, '77', '3'),
(258, '80', '1'),
(259, '80', '2'),
(260, '80', '3'),
(261, '80', '4'),
(262, '80', '5'),
(263, '81', '1'),
(264, '81', '2'),
(265, '81', '3'),
(266, '82', '2'),
(267, '82', '4'),
(268, '82', '5'),
(269, '82', '6'),
(270, '83', ' Ртуть'),
(271, '83', 'Тантал'),
(272, '83', 'Сталь'),
(276, '85', 'Ответ 1'),
(277, '85', 'Ответ 2'),
(278, '85', 'Ответ 3'),
(279, '85', 'Ответ 4'),
(280, '86', '1'),
(281, '86', '2'),
(282, '86', '3'),
(283, '87', '1'),
(284, '87', '2'),
(285, '87', '3'),
(289, '89', '1'),
(290, '89', '2'),
(291, '89', '3'),
(292, '89', '4'),
(293, '90', '1'),
(294, '90', '2'),
(295, '90', '3'),
(296, '90', '4'),
(297, '90', '5'),
(298, '55', 'литий'),
(299, '91', '12'),
(300, '91', '23'),
(301, '91', '34'),
(302, '91', '1'),
(303, '91', '2'),
(304, '91', '3'),
(305, '91', '1'),
(306, '91', '2'),
(307, '91', '3'),
(308, '91', '1'),
(309, '91', '2'),
(310, '91', '3'),
(311, '91', '1'),
(312, '91', '2'),
(313, '91', '3');

-- --------------------------------------------------------

--
-- Структура таблицы `result_it`
--

CREATE TABLE `result_it` (
  `id` int(11) NOT NULL,
  `kod_p` int(11) NOT NULL,
  `kod_t` varchar(50) NOT NULL,
  `kod_gr` varchar(50) NOT NULL,
  `kod_st` varchar(50) NOT NULL,
  `ball` varchar(50) NOT NULL,
  `oc` varchar(50) NOT NULL,
  `date_t` date NOT NULL,
  `time_t` time NOT NULL,
  `kol_p` varchar(250) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `result_it`
--

INSERT INTO `result_it` (`id`, `kod_p`, `kod_t`, `kod_gr`, `kod_st`, `ball`, `oc`, `date_t`, `time_t`, `kol_p`) VALUES
(1, 14, '14', '2', '3', '90', '5', '2019-06-10', '11:45:43', '3'),
(2, 16, '16', '2', '3', '82', '4', '2019-06-10', '11:45:53', '1'),
(3, 18, '18', '2', '3', '80', '4', '2019-06-10', '11:46:08', '1'),
(4, 20, '20', '2', '3', '70', '4', '2019-06-10', '11:46:16', '1'),
(5, 14, '14', '2', '4', '80', '4', '2019-06-10', '11:47:07', '3'),
(6, 16, '16', '2', '4', '70', '4', '2019-06-10', '11:47:15', '2'),
(7, 17, '24', '1', '1', '100', '5', '2019-06-10', '12:29:28', '1'),
(8, 18, '18', '2', '4', '17.647058823529', '2', '2019-06-10', '12:41:16', '1'),
(9, 17, '17', '2', '4', '26.666666666667', '2', '2019-06-10', '12:41:57', '1'),
(10, 14, '14', '2', '7', '80', '4', '2019-06-10', '12:42:15', '1'),
(11, 16, '16', '2', '7', '30.769230769231', '2', '2019-06-10', '12:42:49', '1'),
(12, 17, '17', '2', '7', '26.666666666667', '2', '2019-06-10', '12:43:02', '1'),
(13, 18, '18', '2', '7', '80', '4', '2019-06-10', '12:43:13', '1'),
(14, 14, '14', '2', '26', '70', '4', '2019-06-10', '12:43:42', '1'),
(15, 16, '16', '2', '26', '80', '4', '2019-06-10', '12:44:09', '1'),
(16, 20, '20', '2', '26', '80', '4', '2019-06-10', '12:44:30', '1'),
(17, 18, '18', '2', '26', '17.647058823529', '2', '2019-06-10', '12:45:08', '1'),
(18, 14, '14', '2', '25', '90', '5', '2019-06-10', '12:45:30', '1'),
(19, 16, '16', '2', '25', '60', '3', '2019-06-10', '12:45:56', '1'),
(20, 17, '17', '2', '25', '65', '3', '2019-06-10', '12:46:16', '1');

-- --------------------------------------------------------

--
-- Структура таблицы `tems`
--

CREATE TABLE `tems` (
  `id` int(11) NOT NULL,
  `kod_p` int(11) NOT NULL,
  `Naim` text CHARACTER SET utf8 NOT NULL,
  `kol_v` varchar(50) NOT NULL,
  `kol_m` varchar(50) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Дамп данных таблицы `tems`
--

INSERT INTO `tems` (`id`, `kod_p`, `Naim`, `kol_v`, `kol_m`) VALUES
(14, 14, 'Тест по теме Физика', '', '5'),
(16, 16, 'Тест по теме астрономия', '', '5'),
(17, 17, 'Тест по теме неорганические вещества', '', '5'),
(18, 18, 'Тест по теме математика', '', '5'),
(20, 20, 'Тест по теме Программирование', '', '5'),
(21, 69, 'Тема 1', '1', '5'),
(23, 71, 'Тема 1', '6', '5'),
(24, 17, 'Металлы', '1', '5'),
(25, 17, 'Химические реакции', '', '3'),
(26, 17, 'Строение атома', '', '4'),
(27, 17, 'Поведение веществ в растворах', '', '5'),
(30, 68, '123', '', '5');

-- --------------------------------------------------------

--
-- Структура таблицы `test`
--

CREATE TABLE `test` (
  `id` int(11) NOT NULL,
  `Naim` varchar(250) NOT NULL,
  `kol_t` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `test`
--

INSERT INTO `test` (`id`, `Naim`, `kol_t`) VALUES
(14, 'Физика', 0),
(16, 'Астрономия', 0),
(17, 'Химия', 0),
(18, 'Математика', 0),
(20, 'Программирование', 0),
(31, 'Геометрия', 1),
(68, 'Геология', 1),
(69, 'Математика (проф. ТП)', 0),
(71, 'Тестовая дисциплина1111', 0);

-- --------------------------------------------------------

--
-- Структура таблицы `users`
--

CREATE TABLE `users` (
  `id` int(11) NOT NULL,
  `kod_gr` varchar(50) NOT NULL,
  `Fio` varchar(250) NOT NULL,
  `pass` varchar(250) NOT NULL,
  `prava` varchar(50) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `users`
--

INSERT INTO `users` (`id`, `kod_gr`, `Fio`, `pass`, `prava`) VALUES
(1, '1', 'Иванов', 'c3284d0f94606de1fd2af172aba15bf3', '1'),
(2, '1', 'Смирнов', 'c3284d0f94606de1fd2af172aba15bf3', '1'),
(3, '2', 'Иванов', 'fb469d7ef430b0baf0cab6c436e70375', '0'),
(4, '2', 'Петрова', 'fb469d7ef430b0baf0cab6c436e70375', '0'),
(8, '4', 'Сергей', 'fb469d7ef430b0baf0cab6c436e70375', '0'),
(19, '1', 'Иванов1', 'c3284d0f94606de1fd2af172aba15bf3', '1'),
(22, '4', 'Павел', 'fb469d7ef430b0baf0cab6c436e70375', '0'),
(23, '1', 'Петр', 'c3284d0f94606de1fd2af172aba15bf3', '1'),
(25, '2', 'Антонов Николай Владимирович', 'fb469d7ef430b0baf0cab6c436e70375', '0'),
(26, '2', 'Петров Петр', 'fb469d7ef430b0baf0cab6c436e70375', '0');

-- --------------------------------------------------------

--
-- Структура таблицы `vopr`
--

CREATE TABLE `vopr` (
  `id` int(11) NOT NULL,
  `kod_t` varchar(50) NOT NULL,
  `vopr` varchar(250) NOT NULL,
  `npo` varchar(50) NOT NULL,
  `kol_o` int(11) NOT NULL,
  `sloj` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `vopr`
--

INSERT INTO `vopr` (`id`, `kod_t`, `vopr`, `npo`, `kol_o`, `sloj`) VALUES
(30, '14', 'Как вычислить объем комнаты?', '90', 0, 3),
(31, '14', 'В Америке температуру измеряют по шкале Фаренгейта, а в России по шкале?', '93', 0, 2),
(32, '14', 'Величина равная отношению силы, действующей перпендикулярно поверхности, к площади этой поверхности?', '96', 0, 3),
(33, '14', 'Величина, характеризующая тепловое состояние чего-либо?', '99', 0, 3),
(34, '14', 'Величина чего-либо в длину, ширину и высоту, измеряя в кубических единицах?', '102', 0, 4),
(48, '14', 'Сколько килограммов в 2500 грамм', '153', 0, 4),
(49, '16', 'Какая самая большая планета в солнечной системе?', '156', 0, 4),
(50, '16', 'На какое расстояние луна отдалена от земли?', '161', 0, 2),
(51, '16', 'Сколько планет в Солнечной системе?', '162', 0, 3),
(52, '16', 'Какая звезда ближе к нашей солнечной системе?', '167', 0, 2),
(53, '16', 'На каком расстоянии находится солнце от нашей земли?', '168', 0, 2),
(54, '17', 'Сколько атомов у водорода?', '173', 0, 2),
(55, '17', 'Названия каких элементов схоже с названием планет?', '174,175', 2, 4),
(56, '17', 'Как называются вещества, состоящие из атомов одного вида?', '177', 0, 1),
(57, '17', 'Цвет фенолфталеина в щелочах?', '180', 0, 1),
(58, '17', '	 Объем одного моль газа?', '183', 0, 1),
(59, '18', 'Куб 9 минус 11*55=?', '186', 0, 3),
(60, '18', 'Как вычислить объем комнаты?', '189', 0, 3),
(61, '18', '2 в 7 степени = ?', '193', 0, 2),
(62, '18', 'Как вычислить окружность', '195', 0, 2),
(63, '18', '51*200/2', '198', 0, 3),
(65, '20', '13 в двоичной системе счисления = ?', '201', 0, 2),
(66, '20', 'Выберите правильный IP-адрес', '207', 0, 2),
(67, '20', 'Что такое цикл?', '212', 0, 3),
(68, '20', 'Что такое алгоритм?', '213', 0, 3),
(69, '17', 'Наименьшая неделимая частица элементов?', '216', 0, 2),
(70, '18', 'Вопрос Математика 1', '219', 0, 4),
(83, '17', 'Жидкий метал?', '270', 2, 2),
(86, '23', 'Djghjc 1', '280', 0, 3),
(87, '23', 'Вопрос 2', '283,284,285', 3, 4),
(89, '23', '4', '289,290,291', 3, 4),
(90, '23', '5', '294,295,296,297', 4, 3),
(91, '24', '2', '299', 0, 3);

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `gruppa`
--
ALTER TABLE `gruppa`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `otv`
--
ALTER TABLE `otv`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `result_it`
--
ALTER TABLE `result_it`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `tems`
--
ALTER TABLE `tems`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `test`
--
ALTER TABLE `test`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `vopr`
--
ALTER TABLE `vopr`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `gruppa`
--
ALTER TABLE `gruppa`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT для таблицы `otv`
--
ALTER TABLE `otv`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=314;

--
-- AUTO_INCREMENT для таблицы `result_it`
--
ALTER TABLE `result_it`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=21;

--
-- AUTO_INCREMENT для таблицы `tems`
--
ALTER TABLE `tems`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=32;

--
-- AUTO_INCREMENT для таблицы `test`
--
ALTER TABLE `test`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=73;

--
-- AUTO_INCREMENT для таблицы `users`
--
ALTER TABLE `users`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=27;

--
-- AUTO_INCREMENT для таблицы `vopr`
--
ALTER TABLE `vopr`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=92;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
